In [9]:
pip install pandas

Requirement already satisfied: pandas in c:\python311\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\python311\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python311\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\python311\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [10]:
import pandas as pd

In [1]:
notas = {'joao':85, 'maria':90, 'pedro':88}
notas

{'joao': 85, 'maria': 90, 'pedro': 88}

In [2]:
print(notas['maria'])

90

In [8]:
notas_aluno = {
    'joao': {'matematica': 90, 'portugues': 85, 'ciencias': 88},
    'maria': {'matematica': 95, 'portugues': 92, 'ciencias': 89},
    'pedro':{'matematica': 80, 'portugues': 75, 'ciencias': 82}
}
notas_aluno

{'joao': {'matematica': 90, 'portugues': 85, 'ciencias': 88},
 'maria': {'matematica': 95, 'portugues': 92, 'ciencias': 89},
 'pedro': {'matematica': 80, 'portugues': 75, 'ciencias': 82}}

In [16]:
nota_maria = notas_aluno['maria']
print('a nota de maria é:', nota_maria)

a nota de maria é: {'matematica': 95, 'portugues': 92, 'ciencias': 89}

In [18]:
nota_maria_matematica = notas_aluno['maria']['matematica']
print('a nota de maria de matematica é:', nota_maria_matematica)

a nota de maria de matematica é: 95

In [21]:
# add pesso na lista ja feita
notas_aluno['ana'] = {'matematica': 88, 'portugues':91, 'ciencias':85}
notas_aluno

{'joao': {'matematica': 90, 'portugues': 85, 'ciencias': 88},
 'maria': {'matematica': 95, 'portugues': 92, 'ciencias': 89},
 'pedro': {'matematica': 80, 'portugues': 75, 'ciencias': 82},
 'ana': {'matematica': 88, 'portugues': 91, 'ciencias': 85}}

In [22]:
df = pd.DataFrame(notas_aluno)
print(df)

            joao  maria  pedro  ana
matematica    90     95     80   88
portugues     85     92     75   91
ciencias      88     89     82   85

In [27]:
dados_dois_alunos = df.loc[:, ['joao', 'maria']]
dados_dois_alunos

            joao  maria
matematica    90     95
portugues     85     92
ciencias      88     89

In [26]:
df['joao']

matematica    90
portugues     85
ciencias      88
Name: joao, dtype: int64

In [25]:
df['joao']['matematica']

90

In [30]:
datas = ['01-01-2024', '01-02-2024', '01-03-2024']

In [39]:
datas_formatadas = pd.to_datetime(datas, format='%d-%m-%Y')
df['data'] = datas_formatadas

df

            joao  maria  pedro  ana       data   ano  mes
matematica    90     95     80   88 2024-01-01  2024    1
portugues     85     92     75   91 2024-02-01  2024    2
ciencias      88     89     82   85 2024-03-01  2024    3

In [38]:
df['data'] = pd.to_datetime(df['data'], format='%d-%m-%Y')
df['ano'] = df['data'].dt.year
df['mes'] = df['data'].dt.month

df

            joao  maria  pedro  ana       data   ano  mes
matematica    90     95     80   88 2024-01-01  2024    1
portugues     85     92     75   91 2024-02-01  2024    2
ciencias      88     89     82   85 2024-03-01  2024    3